---
kind: type
id: T:Autodesk.Revit.DB.Architecture.TopRail
source: html/af4ab000-e209-ae94-fbfc-76ee3171d043.htm
---
# Autodesk.Revit.DB.Architecture.TopRail

Represents a top rail element in Autodesk Revit.

## Syntax (C#)
```csharp
public class TopRail : ContinuousRail
```